#pragma once
<<<<<<< HEAD
#include <string>
class RegexUtils
{
    public:
        /** Проверява дали е валиден регулярния израз.
         * Проверява дали има единствено букви от азбуката на автомата, дали скобите са поставени по правилен начин.
         * Дали има 2 напълно независими операции една до друга
         */

        static bool isValidRegex(std::string);

        /** Добавя точки, при две букви една до друга
         * Прието е освен с точки, конкатенацията да бъде представена и без знак
         * Понеже алгоритъмът, обработващ регулярният израз изисква поставени точки, тогава в случаите когато е представена без точки,
         * тази функция сама ще си добави необходимите точки на съответните места.
         */
        static std::string addPointsWhereAreMissing(std::string);
    
};


=======
class RegexUtils
{
public:

private:

};

>>>>>>> 8983b3930fb6ca799b6d3e0427ff30f459408f58
